import * as Yup from "yup";

export const userSchema = Yup.object().shape({
  username: Yup.string()
    .required("نام کاربری اجباری است.")
    .matches(
      /^[A-z][A-z0-9-_]{3,23}$/,
      "نام کاربری باید 4 تا 24 کاراکتر باشد، با حرف شروع شده و کاراکترهای مجاز شامل حروف، اعداد، خط تیره و آندراسکور می باشد."
    ),
  password: Yup.string()
    .required("نام کاربری اجباری است.")
    .matches(
      /^(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!@#$%]).{8,24}$/,
      "رمز عبور باید 8 تا 24 کاراکتر باشد، باید شامل حروف بزرگ و کوچک، اعداد و حروف ویژه شامل @!#$% باشد."
    ),
  confirmPassword: Yup.string()
    .required("نام کاربری اجباری است.")
    .matches(
      /^(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!@#$%]).{8,24}$/,
      "رمز عبور باید 8 تا 24 کاراکتر باشد، باید شامل حروف بزرگ و کوچک، اعداد و حروف ویژه شامل @!#$% باشد."
    )
    .oneOf([Yup.ref("password"), null], "رمزهای عبور مطابق نیستند."),
});
